python/certificates/testbericht

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:nedu:measurements:data:measurementseriesrevisionrequest:1:standard" xmlns:v1="http://sys.svc.tennet.nl/MMCHub/Header/v1">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"/>
      <v1:MessageAddressing>
         <v1:technicalMessageId>?</v1:technicalMessageId>
         <!--Optional:-->
         <v1:correlationId>?</v1:correlationId>
         <v1:senderId>?</v1:senderId>
         <v1:receiverId>?</v1:receiverId>
         <v1:carrierId>?</v1:carrierId>
         <!--Optional:-->
         <v1:contentType>?</v1:contentType>
      </v1:MessageAddressing>
   </soapenv:Header>
   <soapenv:Body>
      <urn:MeasurementSeriesRevisionRequest>
         <urn:EDSNBusinessDocumentHeader>
            <!--Optional:-->
            <urn:ContentHash>?</urn:ContentHash>
            <!--Optional:-->
            <urn:ConversationID>?</urn:ConversationID>
            <!--Optional:-->
            <urn:CorrelationID>?</urn:CorrelationID>
            <urn:CreationTimestamp>?</urn:CreationTimestamp>
            <!--Optional:-->
            <urn:DocumentID>?</urn:DocumentID>
            <!--Optional:-->
            <urn:ExpiresAt>?</urn:ExpiresAt>
            <urn:MessageID>?</urn:MessageID>
            <!--Optional:-->
            <urn:ProcessTypeID>?</urn:ProcessTypeID>
            <!--Optional:-->
            <urn:RepeatedRequest>?</urn:RepeatedRequest>
            <!--Optional:-->
            <urn:TestRequest>?</urn:TestRequest>
            <urn:Destination>
               <urn:Receiver>
                  <!--Optional:-->
                  <urn:Authority>?</urn:Authority>
                  <!--Optional:-->
                  <urn:ContactTypeIdentifier>?</urn:ContactTypeIdentifier>
                  <urn:ReceiverID>?</urn:ReceiverID>
               </urn:Receiver>
               <!--Optional:-->
               <urn:Service>
                  <!--Optional:-->
                  <urn:ServiceMethod>?</urn:ServiceMethod>
                  <!--Optional:-->
                  <urn:ServiceName>?</urn:ServiceName>
               </urn:Service>
            </urn:Destination>
            <!--Optional:-->
            <urn:Manifest>
               <urn:NumberofItems>?</urn:NumberofItems>
               <!--1 or more repetitions:-->
               <urn:ManifestItem>
                  <!--Optional:-->
                  <urn:Description>?</urn:Description>
                  <!--Optional:-->
                  <urn:LanguageCode>?</urn:LanguageCode>
                  <urn:MimeTypeQualifierCode>?</urn:MimeTypeQualifierCode>
                  <urn:UniformResourceIdentifier>?</urn:UniformResourceIdentifier>
               </urn:ManifestItem>
            </urn:Manifest>
            <urn:Source>
               <!--Optional:-->
               <urn:Authority>?</urn:Authority>
               <!--Optional:-->
               <urn:ContactTypeIdentifier>?</urn:ContactTypeIdentifier>
               <urn:SenderID>?</urn:SenderID>
            </urn:Source>
         </urn:EDSNBusinessDocumentHeader>
         <urn:Measurement_Series>
            <urn:mRID>?</urn:mRID>
            <urn:product>?</urn:product>
            <!--Optional:-->
            <urn:referenceTimeSeries_mRID>?</urn:referenceTimeSeries_mRID>
            <urn:reasonRevisionRequest>?</urn:reasonRevisionRequest>
            <!--Optional:-->
            <urn:explanationRevisionRequest>?</urn:explanationRevisionRequest>
            <urn:MarketEvaluationPoint>
               <urn:mRID>?</urn:mRID>
            </urn:MarketEvaluationPoint>
            <urn:MarketParticipant>
               <urn:mRID>?</urn:mRID>
               <urn:MarketRole>
                  <urn:type>?</urn:type>
               </urn:MarketRole>
            </urn:MarketParticipant>
            <urn:DateAndOrTime>
               <urn:startDateTime>?</urn:startDateTime>
               <urn:endDateTime>?</urn:endDateTime>
            </urn:DateAndOrTime>
            <!--Zero or more repetitions:-->
            <urn:Detail_Series>
               <urn:resolution>?</urn:resolution>
               <urn:Product>
                  <urn:identification>?</urn:identification>
                  <urn:measureUnit>?</urn:measureUnit>
               </urn:Product>
               <!--Optional:-->
               <urn:FlowDirection>
                  <urn:direction>?</urn:direction>
               </urn:FlowDirection>
               <!--1 or more repetitions:-->
               <urn:Original_Point>
                  <urn:position>?</urn:position>
                  <urn:quantity>?</urn:quantity>
               </urn:Original_Point>
               <!--Zero or more repetitions:-->
               <urn:Proposed_Point>
                  <urn:position>?</urn:position>
                  <urn:quantity>?</urn:quantity>
               </urn:Proposed_Point>
            </urn:Detail_Series>
         </urn:Measurement_Series>
      </urn:MeasurementSeriesRevisionRequest>
   </soapenv:Body>
</soapenv:Envelope>